export const QnAData = [
  {
    id: 1,
    question: "놀이할 때, 당신은 어떻게 행동하나요?",
    answerA: "A. 다른 고양이들과 활발하게 어울리며 논다.",
    answerB: "B. 혼자만의 시간을 가지며 내가 하고싶은 것을 하며 논다.",
  },
  {
    id: 5,
    question: "낮잠을 자고 일어났을 때, 어떤 행동을 하나요?",
    answerA: "A. 주변을 돌아다니며 같이 놀 다른 고양이들을 찾는다.",
    answerB: "B. 자던 자리에서 식빵을 구우며 주변을 구경한다.",
  },
  {
    id: 2,
    question: "창밖을 바라볼 때, 당신은 무엇을 느끼나요?",
    answerA: "A. 바로 눈앞에서 움직이는 새나 나비에 집중한다.",
    answerB: "B. 바깥세상에 대해 더 많은 상상을 하고 꿈을 꾼다.",
  },
  {
    id: 6,
    question: "새로운 장난감이 주어졌을 때, 어떻게 행동하나요?",
    answerA: "A. 직관적으로 장난감의 움직임에 따라 이동하며 잡으려고 한다.",
    answerB:
      "B. 장난감의 작동 원리에 대해 호기심을 가지고 더 재밌게 놀 방법을 고민해본다.",
  },
  {
    id: 3,
    question: "사냥을 실패했을 때, 어떻게 대처하나요?",
    answerA: "A. 왜 실패했는지 고민해보고 다음 사냥때는 성공할 수 있도록 한다.",
    answerB: "B. 사냥에 실패한 것이 화가 나고 아쉽지만, 곧 다시 도전한다.",
  },
  {
    id: 7,
    question: "다른 고양이가 당신의 영역을 침범했을 때, 어떤 행동을 하나요?",
    answerA: "A. 침착하게 자신의 영역을 어떻게 지킬지 전략을 세운다.",
    answerB: "B. 즉시 털을 세우고 하악질하며 침범한 고양이에게 화를 낸다.",
  },
  {
    id: 4,
    question: "놀이 시간이 끝난 후, 당신은 어떤 반응을 보이나요?",
    answerA: "A. 이번 놀이시간은 끝났으니 다음 놀이시간을 기다린다.",
    answerB: "B. 여전히 조금 더 놀고 싶어서 사람을 따라다닌다.",
  },
  {
    id: 8,
    question: "사료가 나왔을 때 어떻게 반응하나요?",
    answerA: "A. 일정한 시간에 사료가 나오길 기다리며 그 시간에 맞춰 먹는다.",
    answerB: "B. 내가 배고플 때마다 그때그때 사료를 찾아서 먹는다.",
  },
];
