export const reQnAData = [
  {
    reId: 1,
    question: "사회적 모임에서 새로운 사람들을 만나는 것이 즐거운가요?",
    answerA: "A. 네, 새로운 사람들과 대화를 나누는 것을 좋아합니다.",
    answerB:
      "B. 아니요, 혼자 있거나 가까운 사람들과 시간을 보내는 것을 더 선호합니다.",
  },
  {
    reId: 2,
    question:
      "결정을 내릴 때, 세부 사항에 주목하나요 아니면 큰 그림을 보려고 하나요?",
    answerA: "A. 세부 사항에 집중하고 정확한 정보를 바탕으로 결정을 내립니다.",
    answerB: "B. 큰 그림을 보고, 전체적인 가능성을 생각하면서 결정을 내립니다.",
  },
  {
    reId: 3,
    question: "갈등 상황에서 주로 어떤 방식으로 해결하려 하나요?",
    answerA: "A. 논리적이고 객관적인 해결책을 찾으려고 합니다.",
    answerB:
      "B. 상황의 감정적 측면을 고려해 조화로운 해결책을 찾으려고 합니다.",
  },
  {
    reId: 4,
    question:
      "일을 처리할 때 계획을 세우고 조직적으로 진행하나요, 아니면 유연하게 즉흥적으로 처리하나요?",
    answerA: "A. 사전에 계획을 세우고 체계적으로 일을 진행하는 편입니다.",
    answerB: "B. 상황에 따라 즉흥적으로 유연하게 대처하는 편입니다.",
  },
];
